tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "dbt-labs/dbt"

cask_args appdir: "/Applications"

brew "adr-tools"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "glib"
brew "cairo"
brew "cmake"
brew "coreutils"
brew "fzf"
brew "dbt"
brew "direnv"
brew "git"
brew "python@3.7"
brew "pyenv"
brew "pango"
brew "librsvg"
brew "libtool"
brew "imagemagick"
brew "imagemagick@6"
brew "jq"
brew "krb5"
brew "libyaml"
brew "node"
brew "nvm"
brew "plantuml"
brew "postgresql"
brew "maven"
brew "ktlint"
brew "jenv"
brew "gimme-aws-creds"

brew "rbenv"
brew "ruby-build"
brew "redis", restart_service: true
brew "yarn"

cask "adoptopenjdk8"
cask "adoptopenjdk11"
cask "1password"
cask "docker"
cask "exodus"
cask "firefox"
cask "flycut"
cask "gimp"
cask "github"
cask "google-chrome"
cask "graphql-playground"
cask "insomnia"
cask "iterm2"
cask "kindle"
cask "obs"
cask "postman"
cask "pgadmin4"
cask "quip"
cask "signal"
cask "sketchup"
cask "skitch"
cask "slack"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "wechat"
cask "whatsapp"
cask "virtualbox"
# cask "zoom"
cask "zwift"
